Niefr1/Blindsight-Claritone-Senior-Design/STM32N6_Project/Application/NUCLEO-N657X0-Q/Src/main.c
    case CMW_VD65G4_Sensor:
      printf("Camera sensor: VD65G4\r\n");
      break;

    case CMW_IMX335_Sensor:
      printf("Camera sensor: IMX335\r\n");
      break;

    case CMW_OV5640_Sensor:
      printf("Camera sensor: OV5640\r\n");
      break;

    default:
      printf("Camera sensor: UNKNOWN / OTHER\r\n");
      break;
  }
  Display_init();

  /* Start LCD Display camera pipe stream */
  CameraPipeline_DisplayPipe_Start(lcd_bg_buffer, CMW_MODE_CONTINUOUS);

  /*** App header *************************************************************/
  printf("========================================\n");
  printf("STM32N6-GettingStarted-ObjectDetection %s (%s)\n", APP_VERSION_STRING, APP_GIT_SHA1_STRING);
  printf("Build date & time: %s %s\n", __DATE__, __TIME__);
#if defined(__GNUC__)
  printf("Compiler: GCC %d.%d.%d\n", __GNUC__, __GNUC_MINOR__, __GNUC_PATCHLEVEL__);
#elif defined(__ICCARM__)
  printf("Compiler: IAR EWARM %d.%d.%d\n", __VER__ / 1000000, (__VER__ / 1000) % 1000 ,__VER__ % 1000);
#else
  printf("Compiler: Unknown\n");
#endif
  printf("HAL: %lu.%lu.%lu\n", __STM32N6xx_HAL_VERSION_MAIN, __STM32N6xx_HAL_VERSION_SUB1, __STM32N6xx_HAL_VERSION_SUB2);
  printf("STEdgeAI Tools: %d.%d.%d\n", STAI_TOOLS_VERSION_MAJOR, STAI_TOOLS_VERSION_MINOR, STAI_TOOLS_VERSION_MICRO);
  printf("NN model: %s\n", STAI_NETWORK_ORIGIN_MODEL_NAME);
  printf("========================================\n");

  /*** App Loop ***************************************************************/
  while (1)
  {
    CameraPipeline_IspUpdate();

#if DCMIPP_NN_NEEDS_CROP
    /* Start NN camera single capture Snapshot into intermediate buffer */
    CameraPipeline_NNPipe_Start(dcmipp_out_nn, CMW_MODE_SNAPSHOT);
#else
    /* Start NN camera single capture Snapshot directly into NN input */
    printf("Before NN pipe\r\n");
    CameraPipeline_NNPipe_Start(nn_in, CMW_MODE_SNAPSHOT);
#endif

    while (cameraFrameReceived == 0) {};
    cameraFrameReceived = 0;
    printf("Frame received\r\n");
    uint32_t ts[2] = { 0 };

#if DCMIPP_NN_NEEDS_CROP
    /*
     * Crop the image: the DCMIPP hardware requires output dimensions to be
     * multiples of 16, so we crop the padded buffer into the NN input buffer.
     */
    SCB_InvalidateDCache_by_Addr(dcmipp_out_nn, sizeof(dcmipp_out_nn));
    img_crop(dcmipp_out_nn, nn_in, pitch_nn, STAI_NETWORK_IN_1_WIDTH, STAI_NETWORK_IN_1_HEIGHT, STAI_NETWORK_IN_1_CHANNEL);
    SCB_CleanInvalidateDCache_by_Addr(nn_in, nn_in_len);
#endif

    ts[0] = HAL_GetTick();
    /* run ATON inference */
    ret = stai_network_run(network_context, STAI_MODE_SYNC);
    assert(ret == 0);
    ts[1] = HAL_GetTick();
    printf("After inference\r\n");

    int32_t ret = app_postprocess_run((void **) nn_out, number_output, &pp_output, &pp_params);
    assert(ret == 0);

    printf("Objects: %lu\r\n", pp_output.nb_detect);

    Claritone_HandleFrame(&pp_output);

    Display_NetworkOutput(&pp_output, ts[1] - ts[0]);
    /* Discard nn_out region (used by pp_input and pp_outputs variables) to avoid Dcache evictions during nn inference */
    for (int i = 0; i < number_output; i++)
    {
      void *tmp = nn_out[i];
      SCB_InvalidateDCache_by_Addr(tmp, nn_out_len[i]);
    }
  }
}

static const char *Claritone_ZoneToString(claritone_zone_t zone)
{
  switch (zone)
  {
    case ZONE_LEFT:
      return "LEFT";

    case ZONE_CENTER:
      return "CENTER";

    case ZONE_RIGHT:
      return "RIGHT";

    default:
      return "UNKNOWN";
  }
}

static claritone_zone_t Claritone_GetZone(float x_center)
{
  if (x_center < 0.33f)
  {
    return ZONE_LEFT;
  }
  else if (x_center < 0.66f)
  {
    return ZONE_CENTER;
  }
  else
  {
    return ZONE_RIGHT;
  }
}

static bool Claritone_IsPersonClass(int class_id)
{
  if (class_id < 0)
  {
    return false;
  }

  if (classes_table[class_id] == NULL)
  {
    return false;
  }

  return (strcmp(classes_table[class_id], "person") == 0);
}

static claritone_target_t Claritone_SelectBestPerson(
    const od_pp_out_t *p_postprocess)
{
  claritone_target_t best = {0};

  od_pp_outBuffer_t *rois = p_postprocess->pOutBuff;
  uint32_t nb_rois = p_postprocess->nb_detect;

  for (uint32_t i = 0; i < nb_rois; i++)
  {
    if (!Claritone_IsPersonClass(rois[i].class_index))
    {
      continue;
    }

    if (!best.valid || (rois[i].conf > best.conf))
    {
      best.valid = true;
      best.class_id = rois[i].class_index;
      best.conf = rois[i].conf;
      best.x_center = rois[i].x_center;
      best.y_center = rois[i].y_center;
      best.width = rois[i].width;
      best.height = rois[i].height;
      best.zone = Claritone_GetZone(rois[i].x_center);
    }
  }

  return best;
}

static void Claritone_HandleFrame(const od_pp_out_t *p_postprocess)
{
  static claritone_zone_t last_zone = -1;

  claritone_target_t best_person =
      Claritone_SelectBestPerson(p_postprocess);

  if (best_person.valid)
  {
    if (best_person.zone != last_zone)
    {
      printf("PERSON DETECTED -> %s\r\n",
             Claritone_ZoneToString(best_person.zone));

      last_zone = best_person.zone;
    }
  }
}


static void Hardware_init(void)
{
  /* Power on ICACHE */
  MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_ICACTIVE_Msk;

  /* Set back system and CPU clock source to HSI */
  __HAL_RCC_CPUCLK_CONFIG(RCC_CPUCLKSOURCE_HSI);
  __HAL_RCC_SYSCLK_CONFIG(RCC_SYSCLKSOURCE_HSI);

  HAL_Init();

  SCB_EnableICache();

#if defined(USE_DCACHE)
  /* Power on DCACHE */
  MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_DCACTIVE_Msk;
  SCB_EnableDCache();
#endif

  SystemClock_Config();

  CONSOLE_Config();

  NPURam_enable();

  Fuse_Programming();

  NPUCache_config();

  /*** External NOR Flash *********************************************/
  BSP_XSPI_NOR_Init_t NOR_Init;
  NOR_Init.InterfaceMode = BSP_XSPI_NOR_OPI_MODE;
  NOR_Init.TransferRate = BSP_XSPI_NOR_DTR_TRANSFER;
  BSP_XSPI_NOR_Init(0, &NOR_Init);
  BSP_XSPI_NOR_EnableMemoryMappedMode(0);

  /* Set all required IPs as secure privileged */
  Security_Config();

  IAC_Config();
  set_clk_sleep_mode();

